apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
#if (CONFIG_LPC54_OHCI_IOBUFSIZE & 3) != 0
#  error "IO buffer size must be an even number of 32-bit words"
#endif

/* USB Host Memory **********************************************************/

/* Required Alignment */

#define LPC54_ALIGN_SIZE 16

/* How many pre-allocated I/O buffers */

#if CONFIG_LPC54_OHCI_IOBUFSIZE > 0  && CONFIG_LPC54_OHCI_NIOBUFFERS > 0
#  define LPC54_IOBUFFERS   CONFIG_LPC54_OHCI_NIOBUFFERS
#  define LPC54_IOBUF_ALLOC \
     (CONFIG_LPC54_OHCI_IOBUFSIZE * CONFIG_LPC54_OHCI_NIOBUFFERS)
#else
#  define LPC54_IOBUFFERS   0
#  define LPC54_IOBUF_ALLOC 0
#endif

/* Helper definitions */

#define HCCA             ((struct ohci_hcca_s *)g_hcca)
#define TDTAIL           ((struct lpc54_gtd_s *)g_tdtail_alloc)
#define EDCTRL           ((struct lpc54_ed_s *)g_edctrl_alloc)

/* Periodic intervals 2, 4, 8, 16,and 32 supported */

#define MIN_PERINTERVAL  2
#define MAX_PERINTERVAL  32

/* Descriptors **************************************************************/

/* TD delay interrupt value */

#define TD_DELAY(n) (uint32_t)((n) << GTD_STATUS_DI_SHIFT)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure retains the state of the USB host controller */

struct lpc54_usbhost_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbhost_s
   * to structlpc54_usbhost_s.
   */

  struct usbhost_driver_s drvr;

  /* This is the hub port description understood by class drivers */

  struct usbhost_roothubport_s rhport;

  /* Driver status */

  volatile bool    change;      /* Connection change */
  volatile bool    connected;   /* Connected to device */
  volatile bool    pscwait;     /* TRUE: Thread is waiting for a port status change */

#ifndef CONFIG_OHCI_INT_DISABLE
  uint8_t          ininterval;  /* Minimum periodic IN EP polling interval: 2, 4, 6, 16, or 32 */
  uint8_t          outinterval; /* Minimum periodic IN EP polling interval: 2, 4, 6, 16, or 32 */
#endif

  mutex_t          lock;        /* Support mutually exclusive access */
  sem_t            pscsem;      /* Semaphore to wait Writeback Done Head event */

#ifdef CONFIG_OHCI_HUB
  /* Used to pass external hub port events */

  volatile struct usbhost_hubport_s *hport;
#endif

  struct usbhost_devaddr_s devgen;  /* Address generation data */
};

/* This structure describes one asynchronous transfer */

struct lpc54_xfrinfo_s
{
  volatile bool wdhwait;      /* Thread is waiting for WDH interrupt */
  volatile uint8_t tdstatus;  /* TD control status bits from last Writeback Done Head event */
  uint8_t *buffer;            /* Transfer buffer start */
  uint16_t buflen;            /* Buffer length */
  uint16_t xfrd;              /* Number of bytes transferred */

#ifdef CONFIG_OHCI_ASYNCH
#if LPC54_IOBUFFERS > 0
  /* Remember the allocated DMA buffer address so that it can be freed when
   * the transfer completes.
   */

  uint8_t *alloc;             /* Allocated buffer */
#endif

  /* Retain the callback information for the asynchronous transfer
   * completion.
   */

  usbhost_asynch_t callback;  /* Transfer complete callback */
  void *arg;                  /* Argument that accompanies the callback */
#endif
};

/* The OCHI expects the size of an endpoint descriptor to be 16 bytes.
 * However, the size allocated for an endpoint descriptor is 32 bytes in
 * lpc54_ohciram.h.  This extra 16-bytes is used by the OHCI host driver in
 * order to maintain additional endpoint-specific data.
 */

struct lpc54_ed_s
{
  /* Hardware specific fields */

  struct ohci_ed_s hw;        /* 0-15 */

  /* Software specific fields */

  uint8_t          xfrtype;   /* 16: Transfer type.  See SB_EP_ATTR_XFER_* in usb.h */
  uint8_t          interval;  /* 17: Periodic EP polling interval: 2, 4, 6, 16, or 32 */
  sem_t            wdhsem;    /* 18: Semaphore used to wait for Writeback
                               *     Done Head event */

  /* Unused bytes may follow, depending on the size of sem_t */

  /* Pointer to structure that manages asynchronous transfers on this pipe */

  struct lpc54_xfrinfo_s *xfrinfo;
};

/* The OCHI expects the size of an transfer descriptor to be 16 bytes.
 * However, the size allocated for an endpoint descriptor is 32 bytes in
 * lpc54_ohciram.h.  This extra 16-bytes is used by the OHCI host driver in
 * order to maintain additional endpoint-specific data.
 */

struct lpc54_gtd_s
{
  /* Hardware specific fields */

  struct ohci_gtd_s hw;

  /* Software specific fields */

  struct lpc54_ed_s *ed;      /* Pointer to parent ED */
  uint8_t           pad[12];
};

/* The following is used to manage lists of free EDs, TDs, and TD buffers */

struct lpc54_list_s
{
  struct lpc54_list_s *flink; /* Link to next buffer in the list */
                              /* Variable length buffer data follows */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#ifdef CONFIG_LPC54_OHCI_REGDEBUG
static void lpc54_printreg(uint32_t addr, uint32_t val, bool iswrite);
static void lpc54_checkreg(uint32_t addr, uint32_t val, bool iswrite);
static uint32_t lpc54_getreg(uint32_t addr);
static void lpc54_putreg(uint32_t val, uint32_t addr);
#else
#  define lpc54_getreg(addr)     getreg32(addr)
#  define lpc54_putreg(val,addr) putreg32(val,addr)
#endif

/* Byte stream access helper functions **************************************/

static inline uint16_t lpc54_getle16(const uint8_t *val);
#if 0 /* Not used */
static void lpc54_putle16(uint8_t *dest, uint16_t val);
#endif

/* OHCI memory pool helper functions ****************************************/

static inline void lpc54_edfree(struct lpc54_ed_s *ed);
static  struct lpc54_gtd_s *lpc54_tdalloc(void);
static void lpc54_tdfree(struct lpc54_gtd_s *buffer);
static uint8_t *lpc54_tballoc(void);
static void lpc54_tbfree(uint8_t *buffer);
#if LPC54_IOBUFFERS > 0
static uint8_t *lpc54_allocio(void);
static void lpc54_freeio(uint8_t *buffer);
#endif
static struct lpc54_xfrinfo_s *lpc54_alloc_xfrinfo(void);
static void lpc54_free_xfrinfo(struct lpc54_xfrinfo_s *xfrinfo);

/* ED list helper functions *************************************************/

static inline int lpc54_addctrled(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed);
static inline int lpc54_remctrled(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed);

static inline int lpc54_addbulked(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed);
static inline int lpc54_rembulked(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed);

#if !defined(CONFIG_OHCI_INT_DISABLE) || !defined(CONFIG_OHCI_ISOC_DISABLE)
static unsigned int lpc54_getinterval(uint8_t interval);
static void lpc54_setinttab(uint32_t value, unsigned int interval,
                            unsigned int offset);
#endif

