apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
static inline int lpc54_addinted(struct lpc54_usbhost_s *priv,
                                 const struct usbhost_epdesc_s *epdesc,
                                 struct lpc54_ed_s *ed);
static inline int lpc54_reminted(struct lpc54_usbhost_s *priv,
                                 struct lpc54_ed_s *ed);

static inline int lpc54_addisoced(struct lpc54_usbhost_s *priv,
                                  const struct usbhost_epdesc_s *epdesc,
                                  struct lpc54_ed_s *ed);
static inline int lpc54_remisoced(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed);

/* Descriptor helper functions **********************************************/

static int lpc54_enqueuetd(struct lpc54_usbhost_s *priv,
                           struct lpc54_ed_s *ed, uint32_t dirpid,
                           uint32_t toggle, volatile uint8_t *buffer,
                           size_t buflen);
static int lpc54_ctrltd(struct lpc54_usbhost_s *priv, struct lpc54_ed_s *ed,
                        uint32_t dirpid, uint8_t *buffer, size_t buflen);

/* Interrupt handling *******************************************************/

static int lpc54_usbinterrupt(int irq, void *context, void *arg);

/* USB host controller operations *******************************************/

static int lpc54_wait(struct usbhost_connection_s *conn,
                      struct usbhost_hubport_s **hport);
static int lpc54_rh_enumerate(struct usbhost_connection_s *conn,
                              struct usbhost_hubport_s *hport);
static int lpc54_enumerate(struct usbhost_connection_s *conn,
                           struct usbhost_hubport_s *hport);

static int lpc54_ep0configure(struct usbhost_driver_s *drvr,
                              usbhost_ep_t ep0, uint8_t funcaddr,
                              uint8_t speed, uint16_t maxpacketsize);
static int lpc54_epalloc(struct usbhost_driver_s *drvr,
                         const struct usbhost_epdesc_s *epdesc,
                         usbhost_ep_t *ep);
static int lpc54_epfree(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
static int lpc54_alloc(struct usbhost_driver_s *drvr,
                       uint8_t **buffer, size_t *maxlen);
static int lpc54_free(struct usbhost_driver_s *drvr, uint8_t *buffer);
static int lpc54_ioalloc(struct usbhost_driver_s *drvr,
                         uint8_t **buffer, size_t buflen);
static int lpc54_iofree(struct usbhost_driver_s *drvr, uint8_t *buffer);
static int lpc54_ctrlin(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                        const struct usb_ctrlreq_s *req,
                        uint8_t *buffer);
static int lpc54_ctrlout(struct usbhost_driver_s *drvr, usbhost_ep_t ep0,
                         const struct usb_ctrlreq_s *req,
                         const uint8_t *buffer);
static int lpc54_transfer_common(struct lpc54_usbhost_s *priv,
                                 struct lpc54_ed_s *ed, uint8_t *buffer,
                                 size_t buflen);
#if LPC54_IOBUFFERS > 0
static int lpc54_dma_alloc(struct lpc54_usbhost_s *priv,
                           struct lpc54_ed_s *ed, uint8_t *userbuffer,
                           size_t buflen, uint8_t **alloc);
static void lpc54_dma_free(struct lpc54_usbhost_s *priv,
                           struct lpc54_ed_s *ed, uint8_t *userbuffer,
                           size_t buflen, uint8_t *alloc);
#endif
static ssize_t lpc54_transfer(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
                              uint8_t *buffer, size_t buflen);
#ifdef CONFIG_OHCI_ASYNCH
static void lpc54_asynch_completion(struct lpc54_usbhost_s *priv,
                                    struct lpc54_ed_s *ed);
static int lpc54_asynch(struct usbhost_driver_s *drvr, usbhost_ep_t ep,
                        uint8_t *buffer, size_t buflen,
                        usbhost_asynch_t callback, void *arg);
#endif
static int lpc54_cancel(struct usbhost_driver_s *drvr, usbhost_ep_t ep);
#ifdef CONFIG_OHCI_HUB
static int lpc54_connect(struct usbhost_driver_s *drvr,
                         struct usbhost_hubport_s *hport,
                         bool connected);
#endif
static void lpc54_disconnect(struct usbhost_driver_s *drvr,
                             struct usbhost_hubport_s *hport);

/* Initialization ***********************************************************/

static inline void lpc54_ep0init(struct lpc54_usbhost_s *priv);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* In this driver implementation, support is provided for only a single a
 * single USB device.  All status information can be simply retained in a
 * single global instance.
 */

static struct lpc54_usbhost_s g_usbhost =
{
  .lock = NXMUTEX_INITIALIZER,
  .pscsem = SEM_INITIALIZER(0),
};

/* This is the connection/enumeration interface */

static struct usbhost_connection_s g_usbconn =
{
  .wait      = lpc54_wait,
  .enumerate = lpc54_enumerate,
};

/* Aligned static memory allocations */

static uint8_t g_hcca[LPC54_HCCA_SIZE] \
  aligned_data(LPC54_ALIGN_SIZE);
static uint8_t g_tdtail_alloc[LPC54_TD_SIZE] \
  aligned_data(LPC54_ALIGN_SIZE);
static uint8_t g_edctrl_alloc[LPC54_ED_SIZE] \
  aligned_data(LPC54_ALIGN_SIZE);
static uint8_t g_edfree_alloc[LPC54_EDFREE_SIZE] \
  aligned_data(LPC54_ALIGN_SIZE);
static uint8_t g_tdfree_alloc[LPC54_TDFREE_SIZE] \
  aligned_data(LPC54_ALIGN_SIZE);
static uint8_t g_tbfree_alloc[LPC54_TBFREE_SIZE] \
  aligned_data(LPC54_ALIGN_SIZE);

#if LPC54_IOBUFFERS > 0
static uint8_t g_iobuffers[LPC54_IOBUF_ALLOC] \
  aligned_data(LPC54_ALIGN_SIZE);
#endif

/* This is a free list of EDs and TD buffers */

static struct lpc54_list_s *g_edfree; /* List of unused EDs */
static struct lpc54_list_s *g_tdfree; /* List of unused TDs */
static struct lpc54_list_s *g_tbfree; /* List of unused transfer buffers */
#if LPC54_IOBUFFERS > 0
static struct lpc54_list_s *g_iofree; /* List of unused I/O buffers */
#endif

/* Pool and freelist of transfer structures */

