apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
static struct lpc54_list_s *g_xfrfree;
static struct lpc54_xfrinfo_s g_xfrbuffers[CONFIG_LPC54_OHCI_NPREALLOC];

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc54_printreg
 *
 * Description:
 *   Print the contents of an LPC54xx register operation
 *
 ****************************************************************************/

#ifdef CONFIG_LPC54_OHCI_REGDEBUG
static void lpc54_printreg(uint32_t addr, uint32_t val, bool iswrite)
{
  uinfo("%08x%s%08x\n", addr, iswrite ? "<-" : "->", val);
}
#endif

/****************************************************************************
 * Name: lpc54_checkreg
 *
 * Description:
 *   Get the contents of an LPC54xx register
 *
 ****************************************************************************/

#ifdef CONFIG_LPC54_OHCI_REGDEBUG
static void lpc54_checkreg(uint32_t addr, uint32_t val, bool iswrite)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval = 0;
  static uint32_t count = 0;
  static bool     prevwrite = false;

  /* Is this the same value that we read from/wrote to the same register
   * last time?  Are we polling the register?  If so, suppress the output.
   */

  if (addr == prevaddr && val == preval && prevwrite == iswrite)
    {
      /* Yes.. Just increment the count */

      count++;
    }
  else
    {
      /* No this is a new address or value or operation. Were there any
       * duplicate accesses before this one?
       */

      if (count > 0)
        {
          /* Yes.. Just one? */

          if (count == 1)
            {
              /* Yes.. Just one */

              lpc54_printreg(prevaddr, preval, prevwrite);
            }
          else
            {
              /* No.. More than one. */

              uinfo("[repeats %d more times]\n", count);
            }
        }

      /* Save the new address, value, count, and operation for next time */

      prevaddr  = addr;
      preval    = val;
      count     = 0;
      prevwrite = iswrite;

      /* Show the new regisgter access */

      lpc54_printreg(addr, val, iswrite);
    }
}
#endif

/****************************************************************************
 * Name: lpc54_getreg
 *
 * Description:
 *   Get the contents of an LPC54xx register
 *
 ****************************************************************************/

#ifdef CONFIG_LPC54_OHCI_REGDEBUG
static uint32_t lpc54_getreg(uint32_t addr)
{
  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Check if we need to print this value */

  lpc54_checkreg(addr, val, false);
  return val;
}
#endif

/****************************************************************************
 * Name: lpc54_putreg
 *
 * Description:
 *   Set the contents of an LPC54xx register to a value
 *
 ****************************************************************************/

#ifdef CONFIG_LPC54_OHCI_REGDEBUG
static void lpc54_putreg(uint32_t val, uint32_t addr)
{
  /* Check if we need to print this value */

  lpc54_checkreg(addr, val, true);

  /* Write the value */

  putreg32(val, addr);
}
#endif

/****************************************************************************
 * Name: lpc54_getle16
 *
 * Description:
 *   Get a (possibly unaligned) 16-bit little endian value.
 *
 ****************************************************************************/

static inline uint16_t lpc54_getle16(const uint8_t *val)
{
  return (uint16_t)val[1] << 8 | (uint16_t)val[0];
}

/****************************************************************************
 * Name: lpc54_putle16
 *
 * Description:
 *   Put a (possibly unaligned) 16-bit little endian value.
 *
 ****************************************************************************/

#if 0 /* Not used */
static void lpc54_putle16(uint8_t *dest, uint16_t val)
{
  dest[0] = val & 0xff; /* Little endian means LS byte first in byte stream */
  dest[1] = val >> 8;
}
#endif

/****************************************************************************
 * Name: lpc54_edfree
 *
 * Description:
 *   Return an endpoint descriptor to the free list
 *
 ****************************************************************************/

static inline void lpc54_edfree(struct lpc54_ed_s *ed)
{
  struct lpc54_list_s *entry = (struct lpc54_list_s *)ed;

  /* Put the ED back into the free list */

  entry->flink = g_edfree;
  g_edfree     = entry;
}

/****************************************************************************
 * Name: lpc54_tdalloc
 *
 * Description:
 *   Allocate an transfer descriptor from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protected from conconcurrent access to the TD pool by the interrupt
 *     handler
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

static struct lpc54_gtd_s *lpc54_tdalloc(void)
{
  struct lpc54_gtd_s *ret;
  irqstate_t flags;

  /* Disable interrupts momentarily so that lpc54_tdfree is not called from
   * the interrupt handler.
   */

  flags = enter_critical_section();
  ret   = (struct lpc54_gtd_s *)g_tdfree;
  if (ret)
    {
      g_tdfree = ((struct lpc54_list_s *)ret)->flink;
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: lpc54_tdfree
 *
 * Description:
 *   Return an transfer descriptor to the free list
 *
 * Assumptions:
 *   - Only called from the WDH interrupt handler (and during
 *     initialization).
 *   - Interrupts are disabled in any case.
 *
 ****************************************************************************/

static void lpc54_tdfree(struct lpc54_gtd_s *td)
{
  struct lpc54_list_s *tdfree = (struct lpc54_list_s *)td;

  /* This should not happen but just to be safe, don't free the common, pre-
   * allocated tail TD.
   */

  if (tdfree != NULL && td != TDTAIL)
    {
      tdfree->flink = g_tdfree;
      g_tdfree      = tdfree;
    }
}

/****************************************************************************
 * Name: lpc54_tballoc
 *
 * Description:
 *   Allocate an request/descriptor transfer buffer from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

static uint8_t *lpc54_tballoc(void)
{
  uint8_t *ret = (uint8_t *)g_tbfree;
  if (ret)
    {
      g_tbfree = ((struct lpc54_list_s *)ret)->flink;
    }

  return ret;
}

/****************************************************************************
 * Name: lpc54_tbfree
 *
 * Description:
 *   Return an request/descriptor transfer buffer to the free list
 *
 ****************************************************************************/

static void lpc54_tbfree(uint8_t *buffer)
{
  struct lpc54_list_s *tbfree = (struct lpc54_list_s *)buffer;

