apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
  if (tbfree)
    {
      tbfree->flink              = g_tbfree;
      g_tbfree                   = tbfree;
    }
}

/****************************************************************************
 * Name: lpc54_allocio
 *
 * Description:
 *   Allocate an IO buffer from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

#if LPC54_IOBUFFERS > 0
static uint8_t *lpc54_allocio(void)
{
  uint8_t *ret;
  irqstate_t flags;

  /* lpc54_freeio() may be called from the interrupt level */

  flags = enter_critical_section();
  ret = (uint8_t *)g_iofree;
  if (ret)
    {
      g_iofree = ((struct lpc54_list_s *)ret)->flink;
    }

  leave_critical_section(flags);
  return ret;
}
#endif

/****************************************************************************
 * Name: lpc54_freeio
 *
 * Description:
 *   Return an TD buffer to the free list
 *
 ****************************************************************************/

#if LPC54_IOBUFFERS > 0
static void lpc54_freeio(uint8_t *buffer)
{
  struct lpc54_list_s *iofree;
  irqstate_t flags;

  /* Could be called from the interrupt level */

  flags         = enter_critical_section();
  iofree        = (struct lpc54_list_s *)buffer;
  iofree->flink = g_iofree;
  g_iofree      = iofree;
  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: lpc54_alloc_xfrinfo
 *
 * Description:
 *   Allocate an asynchronous data structure from the free list
 *
 * Assumptions:
 *   - Never called from an interrupt handler.
 *   - Protection from re-entrance must be assured by the caller
 *
 ****************************************************************************/

static struct lpc54_xfrinfo_s *lpc54_alloc_xfrinfo(void)
{
  struct lpc54_xfrinfo_s *ret;
  irqstate_t flags;

  /* lpc54_free_xfrinfo() may be called from the interrupt level */

  flags = enter_critical_section();
  ret = (struct lpc54_xfrinfo_s *)g_xfrfree;
  if (ret)
    {
      g_xfrfree = ((struct lpc54_list_s *)ret)->flink;
    }

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Name: lpc54_freeio
 *
 * Description:
 *   Return an TD buffer to the free list
 *
 ****************************************************************************/

static void lpc54_free_xfrinfo(struct lpc54_xfrinfo_s *xfrinfo)
{
  struct lpc54_list_s *node;
  irqstate_t flags;

  /* Could be called from the interrupt level */

  flags        = enter_critical_section();
  node         = (struct lpc54_list_s *)xfrinfo;
  node->flink  = g_xfrfree;
  g_xfrfree    = node;
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: lpc54_addctrled
 *
 * Description:
 *   Helper function to add an ED to the control list.
 *
 ****************************************************************************/

static inline int lpc54_addctrled(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed)
{
  irqstate_t flags;
  uint32_t regval;

  /* Disable control list processing while we modify the list */

  flags   = enter_critical_section();
  regval = lpc54_getreg(LPC54_OHCI_CTRL);
  regval &= ~OHCI_CTRL_CLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

  /* Add the new bulk ED to the head of the bulk list */

  ed->hw.nexted = lpc54_getreg(LPC54_OHCI_CTRLHEADED);
  lpc54_putreg((uint32_t)ed, LPC54_OHCI_CTRLHEADED);

  /* Re-enable control list processing. */

  lpc54_putreg(0, LPC54_OHCI_CTRLED);

  regval = lpc54_getreg(LPC54_OHCI_CTRL);
  regval |= OHCI_CTRL_CLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: lpc54_remctrled
 *
 * Description:
 *   Helper function remove an ED from the control list.
 *
 ****************************************************************************/

static inline int lpc54_remctrled(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed)
{
  struct lpc54_ed_s *curr;
  struct lpc54_ed_s *prev;
  struct lpc54_ed_s *head;
  irqstate_t flags;
  uint32_t regval;

  /* Disable control list processing while we modify the list */

  flags   = enter_critical_section();
  regval = lpc54_getreg(LPC54_OHCI_CTRL);
  regval &= ~OHCI_CTRL_CLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

  /* Find the ED in the control list. */

  head = (struct lpc54_ed_s *)lpc54_getreg(LPC54_OHCI_CTRLHEADED);
  for (prev = NULL, curr = head;
       curr && curr != ed;
       prev = curr, curr = (struct lpc54_ed_s *)curr->hw.nexted);

  /* It would be a bug if we do not find the ED in the control list. */

  DEBUGASSERT(curr != NULL);

  /* Remove the ED from the control list */

  if (curr != NULL)
    {
      /* Is this ED the first on in the control list? */

      if (prev == NULL)
        {
          /* Yes... set the head of the control list to skip over this ED */

          head = (struct lpc54_ed_s *)ed->hw.nexted;
          lpc54_putreg((uint32_t)head, LPC54_OHCI_CTRLHEADED);
        }
      else
        {
          /* No.. set the forward link of the previous ED in the list
           * skip over this ED.
           */

          prev->hw.nexted = ed->hw.nexted;
        }

      /* Just in case the hardware happens to be processing this ed now...
       * it should go back to the control list head.
       */

      ed->hw.nexted = 0;
    }

  /* Re-enable control list processing if the control list is still non-empty
   * after removing the ED node.
   */

  lpc54_putreg(0, LPC54_OHCI_CTRLED);
  if (lpc54_getreg(LPC54_OHCI_CTRLHEADED) != 0)
    {
      /* If the control list is now empty, then disable it */

      regval  = lpc54_getreg(LPC54_OHCI_CTRL);
      regval &= ~OHCI_CTRL_CLE;
      lpc54_putreg(regval, LPC54_OHCI_CTRL);
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: lpc54_addbulked
 *
 * Description:
 *   Helper function to add an ED to the bulk list.
 *
 ****************************************************************************/

static inline int lpc54_addbulked(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed)
{
#ifndef CONFIG_OHCI_BULK_DISABLE
  irqstate_t flags;
  uint32_t regval;

  /* Disable bulk list processing while we modify the list */

