apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
  flags   = enter_critical_section();
  regval  = lpc54_getreg(LPC54_OHCI_CTRL);
  regval &= ~OHCI_CTRL_BLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

  /* Add the new bulk ED to the head of the bulk list */

  ed->hw.nexted = lpc54_getreg(LPC54_OHCI_BULKHEADED);
  lpc54_putreg((uint32_t)ed, LPC54_OHCI_BULKHEADED);

  /* Re-enable bulk list processing. */

  lpc54_putreg(0, LPC54_OHCI_BULKED);

  regval  = lpc54_getreg(LPC54_OHCI_CTRL);
  regval |= OHCI_CTRL_BLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

  leave_critical_section(flags);
  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: lpc54_rembulked
 *
 * Description:
 *   Helper function remove an ED from the bulk list.
 *
 ****************************************************************************/

static inline int lpc54_rembulked(struct lpc54_usbhost_s *priv,
                                  struct lpc54_ed_s *ed)
{
#ifndef CONFIG_OHCI_BULK_DISABLE
  struct lpc54_ed_s *curr;
  struct lpc54_ed_s *prev;
  struct lpc54_ed_s *head;
  irqstate_t flags;
  uint32_t regval;

  /* Disable bulk list processing while we modify the list */

  flags   = enter_critical_section();
  regval  = lpc54_getreg(LPC54_OHCI_CTRL);
  regval &= ~OHCI_CTRL_BLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

  /* Find the ED in the bulk list. */

  head = (struct lpc54_ed_s *)lpc54_getreg(LPC54_OHCI_BULKHEADED);
  for (prev = NULL, curr = head;
       curr && curr != ed;
       prev = curr, curr = (struct lpc54_ed_s *)curr->hw.nexted);

  /* It would be a bug if we do not find the ED in the bulk list. */

  DEBUGASSERT(curr != NULL);

  /* Remove the ED from the bulk list */

  if (curr != NULL)
    {
      /* Is this ED the first on in the bulk list? */

      if (prev == NULL)
        {
          /* Yes... set the head of the bulk list to skip over this ED */

          head = (struct lpc54_ed_s *)ed->hw.nexted;
          lpc54_putreg((uint32_t)head, LPC54_OHCI_BULKHEADED);
        }
      else
        {
          /* No.. set the forward link of the previous ED in the list
           * skip over this ED.
           */

          prev->hw.nexted = ed->hw.nexted;
        }
    }

  /* Re-enable bulk list processing if the bulk list is still non-empty
   * after removing the ED node.
   */

  lpc54_putreg(0, LPC54_OHCI_BULKED);
  if (lpc54_getreg(LPC54_OHCI_BULKHEADED) != 0)
    {
      /* If the bulk list is now empty, then disable it */

      regval  = lpc54_getreg(LPC54_OHCI_CTRL);
      regval |= OHCI_CTRL_BLE;
      lpc54_putreg(regval, LPC54_OHCI_CTRL);
    }

  leave_critical_section(flags);
  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: lpc54_getinterval
 *
 * Description:
 *   Convert the endpoint polling interval into a HCCA table increment
 *
 ****************************************************************************/

#if !defined(CONFIG_OHCI_INT_DISABLE) || !defined(CONFIG_OHCI_ISOC_DISABLE)
static unsigned int lpc54_getinterval(uint8_t interval)
{
  /* The bInterval field of the endpoint descriptor contains the polling
   * interval for interrupt and isochronous endpoints. For other types of
   * endpoint, this value should be ignored. bInterval is provided in units
   * of 1MS frames.
   */

  if (interval < 3)
    {
      return 2;
    }
  else if (interval < 7)
    {
      return 4;
    }
  else if (interval < 15)
    {
      return 8;
    }
  else if (interval < 31)
    {
      return 16;
    }
  else
    {
      return 32;
    }
}
#endif

/****************************************************************************
 * Name: lpc54_setinttab
 *
 * Description:
 *   Set the interrupt table to the selected value using the provided
 *   interval and offset.
 *
 ****************************************************************************/

#if !defined(CONFIG_OHCI_INT_DISABLE) || !defined(CONFIG_OHCI_ISOC_DISABLE)
static void lpc54_setinttab(uint32_t value, unsigned int interval,
                            unsigned int offset)
{
  unsigned int i;
  for (i = offset; i < HCCA_INTTBL_WSIZE; i += interval)
    {
      HCCA->inttbl[i] = value;
    }
}
#endif

/****************************************************************************
 * Name: lpc54_addinted
 *
 * Description:
 *   Helper function to add an ED to the HCCA interrupt table.
 *
 *   To avoid reshuffling the table so much and to keep life simple in
 *   general, the following rules are applied:
 *
 *     1. IN EDs get the even entries, OUT EDs get the odd entries.
 *     2. Add IN/OUT EDs are scheduled together at the minimum interval of
 *        all IN/OUT EDs.
 *
 *   This has the following consequences:
 *
 *     1. The minimum support polling rate is 2MS, and
 *     2. Some devices may get polled at a much higher rate than they
 *        request.
 *
 ****************************************************************************/

static inline int lpc54_addinted(struct lpc54_usbhost_s *priv,
                                 const struct usbhost_epdesc_s *epdesc,
                                 struct lpc54_ed_s *ed)
{
#ifndef CONFIG_OHCI_INT_DISABLE
  unsigned int interval;
  unsigned int offset;
  uint32_t head;
  uint32_t regval;

  /* Disable periodic list processing.  Does this take effect immediately?
   * Or at the next SOF... need to check.
   */

  regval  = lpc54_getreg(LPC54_OHCI_CTRL);
  regval &= ~OHCI_CTRL_PLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

  /* Get the quantized interval value associated with this ED and save it
   * in the ED.
   */

  interval     = lpc54_getinterval(epdesc->interval);
  ed->interval = interval;
  uinfo("interval: %d->%d\n", epdesc->interval, interval);

  /* Get the offset associated with the ED direction. IN EDs get the even
   * entries, OUT EDs get the odd entries.
   *
   * Get the new, minimum interval. Add IN/OUT EDs are scheduled together
   * at the minimum interval of all IN/OUT EDs.
   */

  if (epdesc->in)
    {
      offset = 0;
      if (priv->ininterval > interval)
        {
          priv->ininterval = interval;
        }
      else
        {
          interval = priv->ininterval;
        }
    }
  else
    {
      offset = 1;
      if (priv->outinterval > interval)
        {
          priv->outinterval = interval;
        }
      else
        {
          interval = priv->outinterval;
        }
    }

  uinfo("min interval: %d offset: %d\n", interval, offset);

  /* Get the head of the first of the duplicated entries.  The first offset
   * entry is always guaranteed to contain the common ED list head.
   */

  head = HCCA->inttbl[offset];

  /* Clear all current entries in the interrupt table for this direction */

  lpc54_setinttab(0, 2, offset);

  /* Add the new ED before the old head of the periodic ED list and set the
   * new ED as the head ED in all of the appropriate entries of the HCCA
   * interrupt table.
   */

  ed->hw.nexted = head;
  lpc54_setinttab((uint32_t)ed, interval, offset);
  uinfo("head: %08x next: %08x\n", ed, head);

  /* Re-enabled periodic list processing */

  regval  = lpc54_getreg(LPC54_OHCI_CTRL);
  regval |= OHCI_CTRL_PLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);
  return OK;
#else
  return -ENOSYS;
#endif
}

/****************************************************************************
 * Name: lpc54_reminted
 *
 * Description:
 *   Helper function to remove an ED from the HCCA interrupt table.
 *
 *   To avoid reshuffling the table so much and to keep life simple in
 *   general, the following rules are applied:
 *
 *     1. IN EDs get the even entries, OUT EDs get the odd entries.
 *     2. Add IN/OUT EDs are scheduled together at the minimum interval of
 *        all IN/OUT EDs.
 *
 *   This has the following consequences:
 *
 *     1. The minimum support polling rate is 2MS, and
 *     2. Some devices may get polled at a much higher rate than they
 *        request.
 *
 ****************************************************************************/

static inline int lpc54_reminted(struct lpc54_usbhost_s *priv,
                                 struct lpc54_ed_s *ed)
{
#ifndef CONFIG_OHCI_INT_DISABLE
  struct lpc54_ed_s *head;
  struct lpc54_ed_s *curr;
  struct lpc54_ed_s *prev;
  unsigned int       interval;
  unsigned int       offset;
  uint32_t           regval;

  /* Disable periodic list processing.  Does this take effect immediately?
   * Or at the next SOF... need to check.
   */

  regval  = lpc54_getreg(LPC54_OHCI_CTRL);
  regval &= ~OHCI_CTRL_PLE;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

