apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
  /* Allocate a structure to retain the information needed when the transfer
   * completes.
   */

  DEBUGASSERT(ed->xfrinfo == NULL);

  xfrinfo = lpc54_alloc_xfrinfo();
  if (xfrinfo == NULL)
    {
      uerr("ERROR: lpc54_alloc_xfrinfo failed\n");
      return -ENOMEM;
    }

  /* Initialize the transfer structure */

  memset(xfrinfo, 0, sizeof(struct lpc54_xfrinfo_s));
  xfrinfo->buffer = buffer;
  xfrinfo->buflen = buflen;

  ed->xfrinfo = xfrinfo;

  /* Set the request for the Writeback Done Head event well BEFORE enabling
   * the transfer.
   */

  ret = lpc54_wdhwait(priv, ed);
  if (ret < 0)
    {
      uerr("ERROR: Device disconnected\n");
      goto errout_with_xfrinfo;
    }

  /* Configure the toggle field in the TD */

  if (dirpid == GTD_STATUS_DP_SETUP)
    {
      toggle = GTD_STATUS_T_DATA0;
    }
  else
    {
      toggle = GTD_STATUS_T_DATA1;
    }

  /* Then enqueue the transfer */

  xfrinfo->tdstatus = TD_CC_NOERROR;
  ret = lpc54_enqueuetd(priv, ed, dirpid, toggle, buffer, buflen);
  if (ret == OK)
    {
      /* Set ControlListFilled.  This bit is used to indicate whether there
       * are TDs on the Control list.
       */

      regval = lpc54_getreg(LPC54_OHCI_CMDST);
      regval |= OHCI_CMDST_CLF;
      lpc54_putreg(regval, LPC54_OHCI_CMDST);

      /* Wait for the Writeback Done Head interrupt */

      ret = nxsem_wait_uninterruptible(&ed->wdhsem);
      if (ret < 0)
        {
          /* Task has been canceled */
        }

      /* Check the TD completion status bits */

      else if (xfrinfo->tdstatus == TD_CC_NOERROR)
        {
          ret = OK;
        }
      else
        {
          uerr("ERROR: Bad TD completion status: %d\n", xfrinfo->tdstatus);
          ret = xfrinfo->tdstatus == TD_CC_STALL ? -EPERM : -EIO;
        }
    }

  /* Make sure that there is no outstanding request on this endpoint */

errout_with_xfrinfo:
  lpc54_free_xfrinfo(xfrinfo);
  ed->xfrinfo = NULL;
  return ret;
}

/****************************************************************************
 * Name: lpc54_usbinterrupt
 *
 * Description:
 *   USB interrupt handler
 *
 ****************************************************************************/

static int lpc54_usbinterrupt(int irq, void *context, void *arg)
{
  struct lpc54_usbhost_s *priv = &g_usbhost;
  struct lpc54_ed_s *ed;
  struct lpc54_xfrinfo_s *xfrinfo;
  uintptr_t tmp;
  uint32_t intst;
  uint32_t pending;
  uint32_t regval;

  /* Read Interrupt Status and mask out interrupts that are not enabled. */

  intst  = lpc54_getreg(LPC54_OHCI_INTST);
  regval = lpc54_getreg(LPC54_OHCI_INTEN);
  uinfo("INST: %08x INTEN: %08x\n", intst, regval);

  pending = intst & regval;
  if (pending != 0)
    {
      /* Root hub status change interrupt */

      if ((pending & OHCI_INT_RHSC) != 0)
        {
          uint32_t rhportst1 = lpc54_getreg(LPC54_OHCI_RHPORTST1);
          uinfo("Root Hub Status Change, RHPORTST1: %08x\n", rhportst1);

          if ((rhportst1 & OHCI_RHPORTST_CSC) != 0)
            {
              uint32_t rhstatus = lpc54_getreg(LPC54_OHCI_RHSTATUS);
              uinfo("Connect Status Change, RHSTATUS: %08x\n", rhstatus);

              /* If DRWE is set, Connect Status Change indicates a remote
               * wake-up event.
               */

              if (rhstatus & OHCI_RHSTATUS_DRWE)
                {
                  uinfo("DRWE: Remote wake-up\n");
                }

              /* Otherwise... Not a remote wake-up event */

              else
                {
                  /* Check current connect status */

                  if ((rhportst1 & OHCI_RHPORTST_CCS) != 0)
                    {
                      /* Connected ... Did we just become connected? */

                      if (!priv->connected)
                        {
                          /* Yes.. connected. */

                          uinfo("Connected\n");
                          priv->connected = true;
                          priv->change    = true;

                          /* Notify any waiters */

                          if (priv->pscwait)
                            {
                              nxsem_post(&priv->pscsem);
                              priv->pscwait = false;
                            }
                        }
                      else
                        {
                          uwarn("WARNING: Spurious status change "
                                "(connected)\n");
                        }

                      /* The LSDA (Low speed device attached) bit is valid
                       * when CCS == 1.
                       */

                      if ((rhportst1 & OHCI_RHPORTST_LSDA) != 0)
                        {
                          priv->rhport.hport.speed = USB_SPEED_LOW;
                        }
                      else
                        {
                          priv->rhport.hport.speed = USB_SPEED_FULL;
                        }

                      uinfo("Speed:%d\n", priv->rhport.hport.speed);
                    }

                  /* Check if we are now disconnected */

                  else if (priv->connected)
                    {
                      /* Yes.. disconnect the device */

                      uinfo("Disconnected\n");
                      priv->connected = false;
                      priv->change    = true;

                      /* Set the port speed to the default (FULL).  We cannot
                       * yet free the function address.  That has to be done
                       * by the class when responds to the disconnection.
                       */

                      priv->rhport.hport.speed = USB_SPEED_FULL;

                      /* Are we bound to a class instance? */

                      if (priv->rhport.hport.devclass)
                        {
                          /* Yes.. Disconnect the class */

                          CLASS_DISCONNECTED(priv->rhport.hport.devclass);
                          priv->rhport.hport.devclass = NULL;
                        }

                      /* Notify any waiters for the Root Hub Status change
                       * event
                       */

                      if (priv->pscwait)
                        {
                          nxsem_post(&priv->pscsem);
                          priv->pscwait = false;
                        }
                    }
                  else
                    {
                       uwarn("WARNING: Spurious status change "
                             "(disconnected)\n");
                    }
                }

              /* Clear the status change interrupt */

              lpc54_putreg(OHCI_RHPORTST_CSC, LPC54_OHCI_RHPORTST1);
            }

