apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
          /* Check for port reset status change */

          if ((rhportst1 & OHCI_RHPORTST_PRSC) != 0)
            {
              /* Release the RH port from reset */

              lpc54_putreg(OHCI_RHPORTST_PRSC, LPC54_OHCI_RHPORTST1);
            }
        }

      /* Writeback Done Head interrupt */

      if ((pending & OHCI_INT_WDH) != 0)
        {
          struct lpc54_gtd_s *td;
          struct lpc54_gtd_s *next;

          /* The host controller just wrote the list of finished TDs into
           * the HCCA done head.  This may include multiple packets that
           * were transferred in the preceding frame.
           *
           * Remove the TD(s) from the Writeback Done Head in the HCCA and
           * return them to the free list.  Note that this is safe because
           * the hardware will not modify the writeback done head again
           * until the WDH bit is cleared in the interrupt status register.
           */

          td = (struct lpc54_gtd_s *)(HCCA->donehead & HCCA_DONEHEAD_MASK);
          HCCA->donehead = 0;
          next = NULL;

          /* Process each TD in the write done list */

          for (; td; td = next)
            {
              /* REVISIT: I have encountered bad TDs in the done list linked
               * after at least one good TD.  This is some consequence of how
               * transfers are being canceled.  But for now, I have only
               * this work-around.
               */

              if ((uintptr_t)td < LPC54_TDFREE_BASE ||
                  (uintptr_t)td >= (LPC54_TDFREE_BASE +
                                    LPC54_TD_SIZE * CONFIG_LP17_OHCI_NTDS))
                {
                  break;
                }

              /* Get the ED in which this TD was enqueued */

              ed      = td->ed;
              DEBUGASSERT(ed != NULL);

              /* If there is a transfer in progress, then the xfrinfo
               * pointer will be non-NULL.  But it appears that a NULL
               * pointer may be received with a spurious interrupt such as
               * may occur after a transfer is canceled.
               */

              xfrinfo = ed->xfrinfo;
              if (xfrinfo)
                {
                  /* Save the condition code from the (single) TD status/
                   * control word.
                   */

                  xfrinfo->tdstatus = (td->hw.ctrl & GTD_STATUS_CC_MASK) >>
                                      GTD_STATUS_CC_SHIFT;

#ifdef CONFIG_DEBUG_USB
                  if (xfrinfo->tdstatus != TD_CC_NOERROR)
                    {
                      /* The transfer failed for some reason... dump some
                       * diagnostic info.
                       */

                      uerr("ERROR: ED xfrtype:%d TD CTRL:%08x/CC:%d "
                           "RHPORTST1:%08x\n",
                           ed->xfrtype, td->hw.ctrl, xfrinfo->tdstatus,
                           lpc54_getreg(LPC54_OHCI_RHPORTST1));
                    }
#endif

                  /* Determine the number of bytes actually transfer by
                   * subtracting the buffer start address from the CBP.  A
                   * value of zero means that all bytes were transferred.
                   */

                  tmp = (uintptr_t)td->hw.cbp;
                  if (tmp == 0)
                    {
                      /* Set the (fake) CBP to the end of the buffer + 1 */

                      tmp = xfrinfo->buflen;
                    }
                  else
                    {
                      DEBUGASSERT(tmp >= (uintptr_t)xfrinfo->buffer);

                      /* Determine the size of the transfer by subtracting
                       * the current buffer pointer (CBP) from the initial
                       * buffer pointer (on packet receipt only).
                       */

                      tmp -= (uintptr_t)xfrinfo->buffer;
                      DEBUGASSERT(tmp < UINT16_MAX);
                    }

                  xfrinfo->xfrd = (uint16_t)tmp;

                  /* Return the TD to the free list */

                  next = (struct lpc54_gtd_s *)td->hw.nexttd;
                  lpc54_tdfree(td);

                  if (xfrinfo->wdhwait)
                    {
                      /* Wake up the thread waiting for the WDH event */

                      nxsem_post(&ed->wdhsem);
                      xfrinfo->wdhwait = false;
                    }

#ifdef CONFIG_OHCI_ASYNCH
                  /* Perform any pending callbacks for the case of
                   * asynchronous transfers.
                   */

                  else if (xfrinfo->callback)
                    {
                      DEBUGASSERT(xfrinfo->wdhwait == false);
                      lpc54_asynch_completion(priv, ed);
                    }
#endif
                }
            }
        }

#ifdef CONFIG_DEBUG_USB
      if ((pending & LPC54_DEBUG_INTS) != 0)
        {
          uerr("ERROR: Unhandled interrupts INTST:%08x\n", intst);
        }
#endif

      /* Clear interrupt status register */

      lpc54_putreg(intst, LPC54_OHCI_INTST);
    }

  return OK;
}

/****************************************************************************
 * Name: lpc54_wait
 *
 * Description:
 *   Wait for a device to be connected or disconnected to/from a hub port.
 *
 * Input Parameters:
 *   conn - The USB host connection instance obtained as a parameter from
 *     the call to the USB driver initialization logic.
 *   hport - The location to return the hub port descriptor that detected
 *     the connection related event.
 *
 * Returned Value:
 *   Zero (OK) is returned on success when a device is connected or
 *   disconnected. This function will not return until either (1) a device
 *   is connected or disconnect to/from any hub port or until (2) some
 *   failure occurs.  On a failure, a negated errno value is returned
 *   indicating the nature of the failure
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

