apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
  DEBUGASSERT(ed->xfrinfo == NULL);

  xfrinfo = lpc54_alloc_xfrinfo();
  if (xfrinfo == NULL)
    {
      uerr("ERROR: lpc54_alloc_xfrinfo failed\n");
      ret = -ENOMEM;
      goto errout_with_lock;
    }

  /* Initialize the transfer structure */

  memset(xfrinfo, 0, sizeof(struct lpc54_xfrinfo_s));
  xfrinfo->buffer   = buffer;
  xfrinfo->buflen   = buflen;
  xfrinfo->callback = callback;
  xfrinfo->arg      = arg;

  ed->xfrinfo       = xfrinfo;

#if LPC54_IOBUFFERS > 0
  /* Allocate an IO buffer if the user buffer does not lie in AHB SRAM */

  ret = lpc54_dma_alloc(priv, ed, buffer, buflen, &xfrinfo->alloc);
  if (ret < 0)
    {
      uerr("ERROR: lpc54_dma_alloc failed: %d\n", ret);
      goto errout_with_lock;
    }

  /* If a buffer was allocated, then use it instead of the callers buffer */

  if (xfrinfo->alloc)
    {
      buffer  = xfrinfo->alloc;
    }
#endif

  /* Set up the transfer */

  ret = lpc54_transfer_common(priv, ed, buffer, buflen);
  if (ret < 0)
    {
      uerr("ERROR: lpc54_transfer_common failed: %d\n", ret);
      goto errout_with_asynch;
    }

  /* And return now.  The callback will be invoked when the transfer
   * completes.
   */

  nxmutex_unlock(&priv->lock);
  return OK;

errout_with_asynch:
#if LPC54_IOBUFFERS > 0
  /* Free any temporary IO buffers */

  lpc54_dma_free(priv, ed, buffer, buflen, xfrinfo->alloc);
#endif

  /* Free the transfer structure */

  lpc54_free_xfrinfo(xfrinfo);
  ed->xfrinfo = NULL;

errout_with_lock:
  nxmutex_unlock(&priv->lock);
  return ret;
}
#endif /* CONFIG_OHCI_ASYNCH */

/****************************************************************************
 * Name: lpc54_cancel
 *
 * Description:
 *   Cancel a pending transfer on an endpoint.  Cancelled synchronous or
 *   asynchronous transfer will complete normally with the error -ESHUTDOWN.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *     call to the class create() method.
 *   ep - The IN or OUT endpoint descriptor for the device endpoint on
 *     which an asynchronous transfer should be transferred.
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value
 *   is returned indicating the nature of the failure.
 *
 ****************************************************************************/

static int lpc54_cancel(struct usbhost_driver_s *drvr, usbhost_ep_t ep)
{
#ifdef CONFIG_OHCI_ASYNCH
  struct lpc54_usbhost_s *priv = (struct lpc54_usbhost_s *)drvr;
#endif
  struct lpc54_ed_s *ed = (struct lpc54_ed_s *)ep;
  struct lpc54_gtd_s *td;
  struct lpc54_gtd_s *next;
  struct lpc54_xfrinfo_s *xfrinfo;
  uint32_t ctrl;
  irqstate_t flags;

  DEBUGASSERT(drvr != NULL && ed != NULL);

  /* These first steps must be atomic as possible */

  flags = enter_critical_section();

  /* It is possible there there is no transfer to be in progress */

  xfrinfo = ed->xfrinfo;
  if (xfrinfo)
    {
      /* It might be possible for no transfer to be in progress (callback ==
       * NULL and wdhwait == false)
       */

#ifdef CONFIG_OHCI_ASYNCH
      if (xfrinfo->callback || xfrinfo->wdhwait)
#else
      if (xfrinfo->wdhwait)
#endif
        {
          /* Control endpoints should not come through this path and
           * isochronous endpoints are not yet implemented.  So we only have
           * to distinguish bulk and interrupt endpoints.
           */

          if (ed->xfrtype == USB_EP_ATTR_XFER_BULK)
            {
              /* Disable bulk list processing while we modify the list */

              ctrl  = lpc54_getreg(LPC54_OHCI_CTRL);
              lpc54_putreg(ctrl & ~OHCI_CTRL_BLE, LPC54_OHCI_CTRL);

              /* Remove the TDs attached to the ED,
               * keeping the ED in the list
               */

              td           = (struct lpc54_gtd_s *)
                             (ed->hw.headp & ED_HEADP_ADDR_MASK);
              ed->hw.headp = LPC54_TDTAIL_ADDR;
              ed->xfrinfo  = NULL;

              /* Re-enable bulk list processing, if it was enabled before */

              lpc54_putreg(0, LPC54_OHCI_BULKED);
              lpc54_putreg(ctrl, LPC54_OHCI_CTRL);
            }
          else
            {
              /* Remove the TDs attached to the ED,
               * keeping the Ed in the list
               */

              td           = (struct lpc54_gtd_s *)
                             (ed->hw.headp & ED_HEADP_ADDR_MASK);
              ed->hw.headp = LPC54_TDTAIL_ADDR;
              ed->xfrinfo  = NULL;
            }

          /* Free all transfer descriptors that were connected to the ED.  In
           * some race conditions with the hardware, this might be none.
           */

          while (td != (struct lpc54_gtd_s *)LPC54_TDTAIL_ADDR)
            {
              next = (struct lpc54_gtd_s *)td->hw.nexttd;
              lpc54_tdfree(td);
              td = next;
            }

          xfrinfo->tdstatus = TD_CC_USER;

          /* If there is a thread waiting for the transfer to complete, then
           * wake up the thread.
           */

          if (xfrinfo->wdhwait)
            {
#ifdef CONFIG_OHCI_ASYNCH
              /* Yes.. there should not also be a callback scheduled */

              DEBUGASSERT(xfrinfo->callback == NULL);
#endif

              /* Wake up the waiting thread */

              nxsem_post(&ed->wdhsem);
              xfrinfo->wdhwait = false;

              /* And free the transfer structure */

              lpc54_free_xfrinfo(xfrinfo);
              ed->xfrinfo = NULL;
            }
#ifdef CONFIG_OHCI_ASYNCH
          else
            {
              /* Otherwise,
               * perform the callback and free the transfer structure
               */

              lpc54_asynch_completion(priv, ed);
            }
#endif
        }
      else
        {
          /* Just free the transfer structure */

          lpc54_free_xfrinfo(xfrinfo);
          ed->xfrinfo = NULL;
        }
    }

  /* Determine the return value */

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: lpc54_connect
 *
 * Description:
 *   New connections may be detected by an attached hub.  This method is the
 *   mechanism that is used by the hub class to introduce a new connection
 *   and port description to the system.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *     call to the class create() method.
 *   hport - The descriptor of the hub port that detected the connection
 *     related event
 *   connected - True: device connected; false: device disconnected
 *
 * Returned Value:
 *   On success, zero (OK) is returned. On a failure, a negated errno value
 *   is returned indicating the nature of the failure.
 *
 ****************************************************************************/

