apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
#ifdef CONFIG_OHCI_HUB
static int lpc54_connect(struct usbhost_driver_s *drvr,
                         struct usbhost_hubport_s *hport,
                         bool connected)
{
  struct lpc54_usbhost_s *priv = (struct lpc54_usbhost_s *)drvr;
  DEBUGASSERT(priv != NULL && hport != NULL);
  irqstate_t flags;

  /* Set the connected/disconnected flag */

  hport->connected = connected;
  uinfo("Hub port %d connected: %s\n",
        hport->port, connected ? "YES" : "NO");

  /* Report the connection event */

  flags = enter_critical_section();
  priv->hport = hport;
  if (priv->pscwait)
    {
      priv->pscwait = false;
      nxsem_post(&priv->pscsem);
    }

  leave_critical_section(flags);
  return OK;
}
#endif

/****************************************************************************
 * Name: lpc54_disconnect
 *
 * Description:
 *   Called by the class when an error occurs and driver has been
 *   disconnected.  The USB host driver should discard the handle to the
 *   class instance (it is stale) and not attempt any further interaction
 *   with the class driver instance (until a new instance is received from
 *   the create() method).  The driver should not called the class'
 *   disconnected() method.
 *
 * Input Parameters:
 *   drvr - The USB host driver instance obtained as a parameter from the
 *      call to the class create() method.
 *   hport - The port from which the device is being disconnected.  Might be
 *      a port on a hub.
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   - Only a single class bound to a single device is supported.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

static void lpc54_disconnect(struct usbhost_driver_s *drvr,
                             struct usbhost_hubport_s *hport)
{
  DEBUGASSERT(hport != NULL);
  hport->devclass = NULL;
}

/****************************************************************************
 * Name: lpc54_ep0init
 *
 * Description:
 *   Initialize ED for EP0, add it to the control ED list, and enable control
 *   transfers.
 *
 * Input Parameters:
 *   priv - private driver state instance.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void lpc54_ep0init(struct lpc54_usbhost_s *priv)
{
  /* Initialize the common tail TD. */

  memset(TDTAIL, 0, sizeof(struct lpc54_gtd_s));
  TDTAIL->ed = EDCTRL;

  /* Link the common tail TD to the ED's TD list */

  memset(EDCTRL, 0, sizeof(struct lpc54_ed_s));
  EDCTRL->hw.headp = (uint32_t)TDTAIL;
  EDCTRL->hw.tailp = (uint32_t)TDTAIL;
  EDCTRL->xfrtype  = USB_EP_ATTR_XFER_CONTROL;

  /* Set the head of the control list to the NULL (for now). */

  lpc54_putreg(0, LPC54_OHCI_CTRLHEADED);

  /* Then add EP0 to the empty Control List */

  lpc54_addctrled(priv, EDCTRL);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lpc54_usbhost_initialize
 *
 * Description:
 *   Initialize USB host device controller hardware.
 *
 * Input Parameters:
 *   controller -- If the device supports more than USB host controller, then
 *     this identifies which controller is being initialized.  Normally, this
 *     is just zero.
 *
 * Returned Value:
 *   And instance of the USB host interface.  The controlling task should
 *   use this interface to (1) call the wait() method to wait for a device
 *   to be connected, and (2) call the enumerate() method to bind the device
 *   to a class driver.
 *
 * Assumptions:
 * - This function should called in the initialization sequence in order
 *   to initialize the USB device functionality.
 * - Class drivers should be initialized prior to calling this function.
 *   Otherwise, there is a race condition if the device is already connected.
 *
 ****************************************************************************/

struct usbhost_connection_s *lpc54_usbhost_initialize(int controller)
{
  struct lpc54_usbhost_s *priv = &g_usbhost;
  struct usbhost_driver_s *drvr;
  struct usbhost_hubport_s *hport;
  struct lpc54_xfrinfo_s *xfrinfo;
  uint32_t regval;
  uint8_t *buffer;
  irqstate_t flags;
  int i;

  /* Sanity checks.  NOTE: If certain OS features are enabled, it may be
   * necessary to increase the size of LPC54_ED/TD_SIZE in lpc54_ohciram.h
   */

  DEBUGASSERT(controller == 0);
  DEBUGASSERT(sizeof(struct lpc54_ed_s)  <= LPC54_ED_SIZE);
  DEBUGASSERT(sizeof(struct lpc54_gtd_s) <= LPC54_TD_SIZE);

  /* Initialize the state data structure */

  /* Initialize the device operations */

  drvr                 = &priv->drvr;
  drvr->ep0configure   = lpc54_ep0configure;
  drvr->epalloc        = lpc54_epalloc;
  drvr->epfree         = lpc54_epfree;
  drvr->alloc          = lpc54_alloc;
  drvr->free           = lpc54_free;
  drvr->ioalloc        = lpc54_ioalloc;
  drvr->iofree         = lpc54_iofree;
  drvr->ctrlin         = lpc54_ctrlin;
  drvr->ctrlout        = lpc54_ctrlout;
  drvr->transfer       = lpc54_transfer;
#ifdef CONFIG_OHCI_ASYNCH
  drvr->asynch         = lpc54_asynch;
#endif
  drvr->cancel         = lpc54_cancel;
#ifdef CONFIG_OHCI_HUB
  drvr->connect        = lpc54_connect;
#endif
  drvr->disconnect     = lpc54_disconnect;

  /* Initialize the public port representation */

  hport                = &priv->rhport.hport;
  hport->drvr          = drvr;
#ifdef CONFIG_OHCI_HUB
  hport->parent        = NULL;
#endif
  hport->ep0           = EDCTRL;
  hport->speed         = USB_SPEED_FULL;
  hport->funcaddr      = 0;

  /* Initialize function address generation logic */

  usbhost_devaddr_initialize(&priv->devgen);
  priv->rhport.pdevgen = &priv->devgen;

#ifndef CONFIG_OHCI_INT_DISABLE
  priv->ininterval  = MAX_PERINTERVAL;
  priv->outinterval = MAX_PERINTERVAL;
#endif
  /* Enable the USB0 OHCI block:
   *
   * Power:  In the PDRUNCFG0 register, set bit PDEN_USB0_PHY. On reset, the
   *   USB block is disabled (PDEN_USB0_PHY = 1).
   * Clock:  To have the full-speed USB operating, select either the System
   *   PLL, or USB PLL, or FRO clock output as the USB0 clock and the clock
   *   must be 48 MHz. The CPU clock must be configured to a minimum
   *   frequency of 12 MHz.  In AHBCLKCTRL2, enable both the USB0 host master
   *   and host slave bits.
   * Port control:  Clear DEV_ENABLE bit in Port Mode register to ensure that
   *   the port is controlled by the USB0 host block. Set ID_EN to enable ID
   *   pin pull-up.
   * Configure GPIO pins.
   * Reset: The USB0 Host AHB master and slave can be reset by toggling
   *   USB0HMR_RST (bit 16) and USB0HSL_RST (bit17) in PRESETCTRL2.
   * Wake-up:  Activity on the USB bus port can wake up the microcontroller
   *   from deep-sleep mode.
   * Interrupts: The USB0_IRQ interrupt is connected to interrupt slot #28
   *   in the NVIC.  The USB0_NEEDCLK signal is connected to slot #27.
   */
#warning Missing logic

  /* Set the OTG status and control register.  Bits 0:1 apparently mean:
   *
   *   00: U1=device, U2=host
   *   01: U1=host, U2=host
   *   10: reserved
   *   11: U1=host, U2=device
   *
   * We need only select U1=host (Bit 0=1, Bit 1 is not used on LPC546x);
   * NOTE: The PORTSEL clock needs to be enabled when accessing OTGSTCTRL
   */

