apache/nuttx/arch/arm/src/lpc54xx/lpc54_usb0_ohci.c
  lpc54_putreg(1, LPC54_USBOTG_STCTRL);

  /* Now we can turn off the PORTSEL clock */

  lpc54_putreg((LPC54_CLKCTRL_ENABLES & ~USBOTG_CLK_PORTSELCLK),
               LPC54_USBOTG_CLKCTRL);

  /* Configure I/O pins */

  usbhost_dumpgpio();
  lpc54_configgpio(GPIO_USB_DP);      /* Positive differential data */
  lpc54_configgpio(GPIO_USB_DM);      /* Negative differential data */
  lpc54_configgpio(GPIO_USB_UPLED);   /* GoodLink LED control signal */
  lpc54_configgpio(GPIO_USB_PPWR);    /* Port Power enable signal for USB port */
  lpc54_configgpio(GPIO_USB_PWRD);    /* Power Status for USB port (host power switch) */
  lpc54_configgpio(GPIO_USB_OVRCR);   /* USB port Over-Current status */
  usbhost_dumpgpio();

  uinfo("Initializing Host Stack\n");

  /* Show AHB SRAM memory map */

#if 0 /* Useful if you have doubts about the layout */
  uinfo("AHB SRAM:\n");
  uinfo("  HCCA:   %08x %d\n",
        LPC54_HCCA_BASE, LPC54_HCCA_SIZE);
  uinfo("  TDTAIL: %08x %d\n",
        LPC54_TDTAIL_ADDR, LPC54_TD_SIZE);
  uinfo("  EDCTRL: %08x %d\n",
        LPC54_EDCTRL_ADDR, LPC54_ED_SIZE);
  uinfo("  EDFREE: %08x %d\n",
        LPC54_EDFREE_BASE, LPC54_ED_SIZE);
  uinfo("  TDFREE: %08x %d\n",
        LPC54_TDFREE_BASE, LPC54_EDFREE_SIZE);
  uinfo("  TBFREE: %08x %d\n",
        LPC54_TBFREE_BASE, LPC54_TBFREE_SIZE);
  uinfo("  IOFREE: %08x %d\n",
        LPC54_IOFREE_BASE, LPC54_IOBUFFERS * CONFIG_LPC54_OHCI_IOBUFSIZE);
#endif

  /* Initialize all the TDs, EDs and HCCA to 0 */

  memset((void *)HCCA,   0, sizeof(struct ohci_hcca_s));
  memset((void *)TDTAIL, 0, sizeof(struct ohci_gtd_s));
  memset((void *)EDCTRL, 0, sizeof(struct lpc54_ed_s));

  nxsem_init(&EDCTRL->wdhsem, 0, 0);

  /* Initialize user-configurable EDs */

  buffer = (uint8_t *)LPC54_EDFREE_BASE;
  for (i = 0; i < CONFIG_LP17_OHCI_NEDS; i++)
    {
      /* Put the ED in a free list */

      lpc54_edfree((struct lpc54_ed_s *)buffer);
      buffer += LPC54_ED_SIZE;
    }

  /* Initialize user-configurable TDs */

  buffer = (uint8_t *)LPC54_TDFREE_BASE;
  for (i = 0; i < CONFIG_LP17_OHCI_NTDS; i++)
    {
      /* Put the TD in a free list */

      lpc54_tdfree((struct lpc54_gtd_s *)buffer);
      buffer += LPC54_TD_SIZE;
    }

  /* Initialize user-configurable request/descriptor transfer buffers */

  buffer = (uint8_t *)LPC54_TBFREE_BASE;
  for (i = 0; i < CONFIG_LPC54_OHCI_TDBUFFERS; i++)
    {
      /* Put the TD buffer in a free list */

      lpc54_tbfree(buffer);
      buffer += CONFIG_LPC54_OHCI_TDBUFSIZE;
    }

#if LPC54_IOBUFFERS > 0
  /* Initialize user-configurable IO buffers */

  buffer = (uint8_t *)LPC54_IOFREE_BASE;
  for (i = 0; i < LPC54_IOBUFFERS; i++)
    {
      /* Put the IO buffer in a free list */

      lpc54_freeio(buffer);
      buffer += CONFIG_LPC54_OHCI_IOBUFSIZE;
    }
#endif

  /* Initialize transfer structures */

  for (i = 0, xfrinfo = g_xfrbuffers;
       i < CONFIG_LPC54_OHCI_NPREALLOC;
       i++, xfrinfo++)
    {
      /* Put the transfer structure in a free list */

      lpc54_free_xfrinfo(xfrinfo);
    }

  /* Wait 50MS then perform hardware reset */

  up_mdelay(50);

  lpc54_putreg(0, LPC54_OHCI_CTRL);        /* Hardware reset */
  lpc54_putreg(0, LPC54_OHCI_CTRLHEADED);  /* Initialize control list head to Zero */
  lpc54_putreg(0, LPC54_OHCI_BULKHEADED);  /* Initialize bulk list head to Zero */

  /* Software reset */

  lpc54_putreg(OHCI_CMDST_HCR, LPC54_OHCI_CMDST);

  /* Write Fm interval (FI), largest data packet counter (FSMPS), and
   * periodic start.
   */

  lpc54_putreg(DEFAULT_FMINTERVAL, LPC54_OHCI_FMINT);
  lpc54_putreg(DEFAULT_PERSTART, LPC54_OHCI_PERSTART);

  /* Put HC in operational state */

  regval  = lpc54_getreg(LPC54_OHCI_CTRL);
  regval &= ~OHCI_CTRL_HCFS_MASK;
  regval |= OHCI_CTRL_HCFS_OPER;
  lpc54_putreg(regval, LPC54_OHCI_CTRL);

  /* Set global power in HcRhStatus */

  lpc54_putreg(OHCI_RHSTATUS_SGP, LPC54_OHCI_RHSTATUS);

  /* Set HCCA base address */

  lpc54_putreg((uint32_t)HCCA, LPC54_OHCI_HCCA);

  /* Set up the root hub port EP0 */

  lpc54_ep0init(priv);

  /* Clear pending interrupts */

  regval = lpc54_getreg(LPC54_OHCI_INTST);
  lpc54_putreg(regval, LPC54_OHCI_INTST);

  /* Enable OHCI interrupts */

  lpc54_putreg((LPC54_ALL_INTS | OHCI_INT_MIE), LPC54_OHCI_INTEN);

  /* Attach USB host controller interrupt handler */

  if (irq_attach(LPC54_IRQ_USB, lpc54_usbinterrupt, NULL) != 0)
    {
      uerr("ERROR: Failed to attach IRQ\n");
      return NULL;
    }

  /* Enable USB interrupts at the SYCON controller.  Disable interrupts
   * because this register may be shared with other drivers.
   */

  flags   = enter_critical_section();
  regval  = lpc54_getreg(LPC54_SYSCON_USBINTST);
  regval |= SYSCON_USBINTST_ENINTS;
  lpc54_putreg(regval, LPC54_SYSCON_USBINTST);
  leave_critical_section(flags);

  /* If there is a USB device in the slot at power up, then we will not
   * get the status change interrupt to signal us that the device is
   * connected.  We need to set the initial connected state accordingly.
   */

  regval          = lpc54_getreg(LPC54_OHCI_RHPORTST1);
  priv->connected = ((regval & OHCI_RHPORTST_CCS) != 0);

  /* Enable interrupts at the interrupt controller */

  up_enable_irq(LPC54_IRQ_USB); /* enable USB interrupt */
  uinfo("USB host Initialized, Device connected:%s\n",
        priv->connected ? "YES" : "NO");

  return &g_usbconn;
}
